<template>
  <header>
    <div class="container-fluid header-container">
      <logo />
      <div class="flex-block">
        <nav-menu class="header-menu">
          <li class="menu-item"><r-link route="about-app">О приложении</r-link></li>
          <li class="menu-item"><r-link route="countries">Страны</r-link></li>
          <li class="menu-item"><r-link route="partners">Партнерам и авторам</r-link></li>
          <li class="menu-item"><r-link route="feedback">Обратная связь</r-link></li>
          
          <select-language />
        </nav-menu>
        
        <nav-button class="header-button enter-button">
          <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0)"><path d="M7.39311 7.22557C8.38577 7.22557 9.24534 6.86954 9.94766 6.16711C10.65 5.46478 11.006 4.60545 11.006 3.61267C11.006 2.62024 10.65 1.76079 9.94755 1.05824C9.24511 0.356026 8.38566 0 7.39311 0C6.40034 0 5.541 0.356026 4.83868 1.05835C4.13635 1.76067 3.78021 2.62012 3.78021 3.61267C3.78021 4.60545 4.13635 5.4649 4.83879 6.16722C5.54123 6.86943 6.40068 7.22557 7.39311 7.22557Z" /> <path  d="M13.7147 11.5343C13.6945 11.242 13.6535 10.9232 13.5932 10.5865C13.5323 10.2473 13.4539 9.92661 13.3601 9.63353C13.2631 9.3306 13.1313 9.03146 12.9683 8.74478C12.7992 8.44724 12.6005 8.18814 12.3776 7.97494C12.1445 7.75189 11.8591 7.57256 11.529 7.44176C11.2001 7.31164 10.8356 7.24572 10.4457 7.24572C10.2926 7.24572 10.1445 7.30855 9.85851 7.49474C9.6825 7.60953 9.47662 7.74228 9.24683 7.88911C9.05033 8.01431 8.78414 8.13161 8.45535 8.23781C8.13457 8.34161 7.80888 8.39425 7.48741 8.39425C7.16595 8.39425 6.84036 8.34161 6.51924 8.23781C6.1908 8.13172 5.92461 8.01442 5.72834 7.88922C5.50072 7.74377 5.29472 7.61102 5.11608 7.49463C4.83044 7.30843 4.68224 7.24561 4.52911 7.24561C4.1391 7.24561 3.77472 7.31164 3.44593 7.44187C3.11611 7.57245 2.83058 7.75178 2.59724 7.97505C2.37442 8.18837 2.17564 8.44735 2.00672 8.74478C1.84387 9.03146 1.71204 9.33049 1.61499 9.63364C1.52126 9.92673 1.44287 10.2473 1.38199 10.5865C1.32168 10.9227 1.28071 11.2417 1.26045 11.5346C1.24054 11.8216 1.23047 12.1195 1.23047 12.4204C1.23047 13.2034 1.47938 13.8373 1.97021 14.3048C2.45499 14.7661 3.09643 15.0001 3.87646 15.0001H11.0991C11.8791 15.0001 12.5203 14.7662 13.0052 14.3048C13.4961 13.8376 13.745 13.2036 13.745 12.4203C13.7449 12.118 13.7347 11.8199 13.7147 11.5343Z" /></g><defs><clipPath id="clip0"><rect width="15" height="15.0001" /></clipPath></defs></svg>
          <span>Личный кабинет</span>
        </nav-button>

        <nav-button class="header-button-sm enter-button">
          <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0)"><path
                d="M13.6606 13.393C13.9977 13.393 14.2899 13.2817 14.5383 13.0618L10.2885 8.81193C10.1866 8.88495 10.0877 8.95595 9.99437 9.02346C9.67634 9.25777 9.41822 9.44062 9.22001 9.57164C9.02183 9.70296 8.75816 9.83681 8.42902 9.97346C8.09966 10.1103 7.79282 10.1785 7.50818 10.1785H7.49984H7.49151C7.20684 10.1785 6.9 10.1103 6.57067 9.97346C6.24133 9.83681 5.97766 9.70296 5.77967 9.57164C5.58149 9.44062 5.32351 9.2578 5.00532 9.02346C4.91665 8.95845 4.81831 8.88713 4.71199 8.81079L0.461426 13.0618C0.709767 13.2817 1.00212 13.393 1.33927 13.393H13.6606Z"
              />
              <path
                d="M0.845514 6.13568C0.52751 5.92367 0.245509 5.68085 0 5.40735V11.8732L3.7457 8.12753C2.99635 7.60437 2.03085 6.94119 0.845514 6.13568Z"
              />
              <path
                d="M14.163 6.13568C13.0229 6.90736 12.0539 7.57169 11.2559 8.12902L15 11.8734V5.40735C14.76 5.67535 14.481 5.918 14.163 6.13568Z"
              />
              <path
                d="M13.6609 1.60718H1.33969C0.909839 1.60718 0.579361 1.75233 0.34785 2.04234C0.116149 2.33248 0.000488281 2.69534 0.000488281 3.1305C0.000488281 3.482 0.153976 3.86286 0.460814 4.27319C0.767653 4.68335 1.09415 5.00552 1.44015 5.23986C1.62984 5.37388 2.20185 5.77154 3.15619 6.43271C3.67136 6.78971 4.11938 7.10088 4.50437 7.3694C4.83254 7.59805 5.11555 7.79607 5.34921 7.96039C5.37603 7.97921 5.41822 8.00939 5.47421 8.04942C5.53453 8.09275 5.61087 8.14773 5.70504 8.21573C5.88639 8.34689 6.03704 8.45291 6.15703 8.5339C6.27686 8.61492 6.42204 8.70542 6.59236 8.80591C6.76254 8.90626 6.92305 8.98173 7.07371 9.03192C7.22439 9.08208 7.36388 9.10724 7.4922 9.10724H7.50054H7.50887C7.63717 9.10724 7.77668 9.08208 7.92739 9.03192C8.07802 8.98173 8.2384 8.90643 8.40872 8.80591C8.57887 8.70542 8.72386 8.61473 8.84407 8.5339C8.96406 8.45291 9.11472 8.34692 9.29609 8.21573C9.39007 8.14773 9.46641 8.09272 9.52673 8.04956C9.58275 8.00936 9.62491 7.97938 9.65189 7.96039C9.83392 7.83373 10.1176 7.63653 10.499 7.37172C11.1929 6.88955 12.2149 6.17988 13.5693 5.23986C13.9766 4.95536 14.3169 4.61203 14.5905 4.21036C14.8635 3.8087 15.0003 3.38737 15.0003 2.94651C15.0003 2.57818 14.8676 2.26301 14.6028 2.00051C14.3376 1.73833 14.0237 1.60718 13.6609 1.60718Z"
              />
            </g>
            <defs>
              <clipPath id="clip0"><rect width="15" height="15" /></clipPath>
            </defs>
          </svg>
          <span>Обратная связь</span>
        </nav-button>

        <burger-icon class="violet-icon" />
      </div>
    </div>

    <div class="img-circle">
      <img src="assets/img/header-static/header-ellipse.svg" alt="" />
    </div>
    <div class="header-bg">
      <img src="assets/img/header-static/header-static-bg.jpg" alt="" />
    </div>
  </header>
</template>

<script lang="ts">
import Vue from "vue";
import { Component } from "vue-property-decorator";

@Component
export default class FooterDefaultComponent extends Vue {}
</script>

<style lang="css" scoped>
header {
  position: relative;
  background-size: auto;
}

.header-container {
  padding: 22px 15px;
  display: flex;
  align-items: center;
  justify-content: space-between;
}

.flex-block {
  display: flex;
  align-items: center;
  justify-content: space-between;
}

.img-circle {
  position: absolute;
  top: 0;
  left: 0;
  z-index: -1;
  max-height: 91px;
  overflow: hidden;
}

.img-circle img {
  max-width: 100%;
  height: auto;
}

.header-bg {
  position: absolute;
  top: 0;
  right: calc((100vw - 1350px) / (1920 - 1350) * (0 + 260) - 260px);
  z-index: -1;
  max-height: 91px;
  overflow: hidden;
}

@media all and (max-width: 1350px) {
  .header-bg {
    right: calc((100vw - 600px) / (1350 - 600) * (-220 + 380) - 380px);
  }

  .flex-block {
    width: 100%;
    margin-left: 27px;
  }
}

@media all and (max-width: 1150px) {
  .flex-block {
    width: auto;
  }
}

@media all and (max-width: 600px) {
  .header-bg {
    display: none;
  }
}

@media all and (max-width: 505px) {
  .img-circle {
    left: calc((100vw - 280px) / (505 - 280) * (0 + 100) - 100px);
  }

  .header-button-sm {
    display: none;
  }
}

@media all and (max-width: 400px) {
  .header-container {
    padding: 10px 15px;
  }
}

@media all and (min-width: 1921px) {
  .header-bg {
    right: 0;
  }
}
</style>