<template>    
    <section class="partners">
        <div class="container-fluid">
            <section-inside-title>Кому выгодно сотрудничать с нами?</section-inside-title>
            <section-inside-subtitle>Туристическим компаниям</section-inside-subtitle>
            <inside-text>Вы организатор городских прогулок или экстремальных туров? Вне зависимости от формата ваших программ вы получаете доступ к своей целевой аудитории и предлагаете им путешествия принципиально нового формата. Публикуйте свои предложения на нашей платформе и создавайте уникальные туры, отличающиеся от программ ваших конкурентов. В путешествии-квесте туристы чувствуют себя героями фильмов про Индиану Джонса или Лару Крофт, а вы получаете эмоциональную связку – вас запомнят, как умеющего оставлять яркие впечатления организатора путешествий. Мы предлагаем вам платформу для презентации, бронирования и оплаты ваших туров и программ. Хотите стать партнером, получать новых клиентов и повышать лояльность имеющихся? Мы вышлем вам подробные инструкции, обучающие материалы по созданию маршрутов и работе в системе на почту.</inside-text>
        
            <section-inside-subtitle>Гидам и экскурсоводам</section-inside-subtitle>
            <inside-text>Публикуйте маршруты из своей коллекции с аудиосопровождением и фотографиями. Без вашего присутствия сотни туристов будут проходить ваши программы. Если трек становится популярным, то вы получаете деньги за каждый уникальный проход вашего трека туристом, а также призы от наших партнеров. Помимо этого, вы можете установить цену за прохождение маршрута и получать деньги каждый раз, когда турист пройдет по вашему маршруту Хочешь в команду? Оставляй свои контакты в форме ниже.</inside-text>
        
            <section-inside-subtitle>Кафе, барам, магазинам, ресторанам, театрам, музеям</section-inside-subtitle>
            <inside-text>Размещайте артефакты вблизи или внутри ваших заведений и привлекайте новых клиентов! Артефакт может быть размещен на одном из маршрутов, проходящем рядом с вашим заведением. Если таких маршрутов пока нет, то у вас есть возможность его бесплатно создать. Чем популярнее и интереснее будет квест, тем больше посетителей вы потенциально сможете привлечь. Вы также можете размещать информацию о скидках, специальных предложениях и новинках меню в приложении. Пользователи увидят информацию в виде всплывающего элемента дополненной реальности – у такого креативного рекламного хода гораздо больше шансов на успех!</inside-text>
        </div>
    </section>
</template>

<script lang="ts">

    import Vue from "vue";
    import { Component } from 'vue-property-decorator'

    @Component
    export default  class FooterDefaultComponent extends Vue{

    }
    
</script>

<style lang="css" scoped>

.partners {
    padding: 25px 0;
}

</style>